---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.TorsionalModulus
source: html/4c0e7fec-a2c0-eb35-188b-4e15e976887d.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.TorsionalModulus Property

Section modulus for calculations of torsion stresses (Ct).

## Syntax (C#)
```csharp
public double TorsionalModulus { get; set; }
```